In [2]:
import pandas as pd

CREATION OF SERIES USING PANDAS FUNCTION

In [11]:
a = [1,2,3,4,5,6]
pd.Series(a)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

TYPE CONVERSION OF THE LIST ELEMENTS

In [12]:
pd.Series(a, dtype= 'float')

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

GIVING NAME TO THE UNNAMED LIST

In [13]:
pd.Series(a, name= 'python')

0    1
1    2
2    3
3    4
4    5
5    6
Name: python, dtype: int64

DATAFRAMING USING THE LIST

In [20]:
li = [1,2,3,4]
pd.DataFrame(li, columns=['a'])

   a
0  1
1  2
2  3
3  4

READING CSV FILES IN PYTHON

In [23]:
pd.read_csv('Test.csv')
pd.read_csv('testing.csv')

     a     b     c
0  NaN   6.0   NaN
1  2.0   7.0  12.0
2  3.0   NaN  13.0
3  NaN  10.0  15.0

THIS SHOW DROPPING THE NULL VALUES FROM THE DATASET

In [35]:
df = pd.read_csv('testing.csv')
df.dropna(subset= ['a'])
df.dropna(how= 'all')
df.dropna(thresh=2)
df

     a     b     c
0  NaN   6.0   NaN
1  2.0   7.0  12.0
2  3.0   NaN  13.0
3  NaN  10.0  15.0

THIS SHOWS FILLING THE NULL VALUES WITH ALTERNATIVE VALUE

In [45]:
df.fillna(0)
df.fillna(method= 'ffill', axis= 0)
df.fillna(method= 'bfill', axis = 1)
df.fillna(0, limit= 3, inplace=True)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_7644\2320915449.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method= 'ffill', axis= 0)
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_7644\2320915449.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method= 'bfill', axis = 1)

THIS SHOWS THE REPLACING VALUES FROM THE DATASET

In [52]:
df.replace(to_replace= 0, value= 1)
df.replace('[A-z]', 'python', regex= True)
df.replace(0, method= 'bfill', limit= 2)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_7644\2078314161.py:3: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace(0, method= 'bfill', limit= 2)

     a     b     c
0  2.0   6.0  12.0
1  2.0   7.0  12.0
2  3.0  10.0  13.0
3  0.0  10.0  15.0

THIS FUNCTION SHOWS THE INTERPOLATE VALUES IN THE DATASET

In [60]:
a = pd.read_csv('testing.csv')
a.interpolate(axis= 1)
a.interpolate(limit= 2)
a.interpolate(limit_direction='forward')
a.interpolate(limit_area='inside' )

     a     b     c
0  NaN   6.0   NaN
1  2.0   7.0  12.0
2  3.0   8.5  13.0
3  NaN  10.0  15.0